src/InformationRegisters/ОчередьSQL/ОчередьSQL.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьSQL</name>
  <resources>
    <name>ТекстЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяКомпьютера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>TID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>UID</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ОчередьSQL/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если Запись.TID = 0 Тогда
			Запись.TID = ТекущаяУниверсальнаяДатаВМиллисекундах();
			Запись.UID = Новый УникальныйИдентификатор();
			ЭтотОбъект.Отбор.TID.Установить(Запись.TID);
			ЭтотОбъект.Отбор.UID.Установить(Запись.UID);
		КонецЕсли;
	КонецЦикла;
	
	Задание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.ОчередьSQL);
	Задание.Использование = Истина;
	Задание.Записать();
	
КонецПроцедуры
